[Killed] ObjectLiteral
public/src/client/composer-select-format.js:4:19
 'use strict';
 
 define('forum/composer-select-format', ['hooks'], function (hooks) {
-	const Dropdown = {
-		initialised: false,
-	};
+	const Dropdown = {};
 	//Array of available post format templates. Add new templates to extend the dropdown options.
 	const templates = [
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
public/src/client/composer-select-format.js:5:16
 
 define('forum/composer-select-format', ['hooks'], function (hooks) {
 	const Dropdown = {
-		initialised: false,
+		initialised: true,
 	};
 	//Array of available post format templates. Add new templates to extend the dropdown options.
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ObjectLiteral
public/src/client/composer-select-format.js:9:3
 	};
 	//Array of available post format templates. Add new templates to extend the dropdown options.
 	const templates = [
-		{
-			id: 'format1',
-			label: 'Format 1',
-			description: 'Starter layout with header and code block.',
-			body: '## Header\n\n```code```\n\n- Item 1\n- Item 2\n',
-		},
+		{},
 		{
 			id: 'format2',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ObjectLiteral
public/src/client/composer-select-format.js:15:3
 			description: 'Starter layout with header and code block.',
 			body: '## Header\n\n```code```\n\n- Item 1\n- Item 2\n',
 		},
-		{
-			id: 'format2',
-			label: 'Format 2',
-			description: 'Summary/details sections ready to fill in.',
-			body: '### Summary\n\nDescribe the summary.\n\n### Details\n\nAdd the supporting details here.\n',
-		},
+		{},
 	];
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:16:8
 			body: '## Header\n\n```code```\n\n- Item 1\n- Item 2\n',
 		},
 		{
-			id: 'format2',
+			id: "",
 			label: 'Format 2',
 			description: 'Summary/details sections ready to fill in.',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:17:11
 		},
 		{
 			id: 'format2',
-			label: 'Format 2',
+			label: "",
 			description: 'Summary/details sections ready to fill in.',
 			body: '### Summary\n\nDescribe the summary.\n\n### Details\n\nAdd the supporting details here.\n',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:18:17
 		{
 			id: 'format2',
 			label: 'Format 2',
-			description: 'Summary/details sections ready to fill in.',
+			description: "",
 			body: '### Summary\n\nDescribe the summary.\n\n### Details\n\nAdd the supporting details here.\n',
 		},
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:28:10
 		const dropdown = $('<div>').addClass('btn-group btn-group-sm select-format-dropdown').attr('component', 'composer/select-format');
 
 		const button = $('<button>', {
-			type: 'button',
+			type: "",
 			class: 'btn btn-sm btn-link text-body fw-semibold dropdown-toggle',
 			'data-bs-toggle': 'dropdown',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] StringLiteral
public/src/client/composer-select-format.js:29:11
 
 		const button = $('<button>', {
 			type: 'button',
-			class: 'btn btn-sm btn-link text-body fw-semibold dropdown-toggle',
+			class: "",
 			'data-bs-toggle': 'dropdown',
 			'aria-haspopup': 'true',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:31:21
 			type: 'button',
 			class: 'btn btn-sm btn-link text-body fw-semibold dropdown-toggle',
 			'data-bs-toggle': 'dropdown',
-			'aria-haspopup': 'true',
+			'aria-haspopup': "",
 			'aria-expanded': 'false',
 			'aria-label': 'Format option',
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] StringLiteral
public/src/client/composer-select-format.js:33:18
 			'data-bs-toggle': 'dropdown',
 			'aria-haspopup': 'true',
 			'aria-expanded': 'false',
-			'aria-label': 'Format option',
+			'aria-label': "",
 		});
 		button.append($('<i>').addClass('fa fa-list-ul'));
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:35:35
 			'aria-expanded': 'false',
 			'aria-label': 'Format option',
 		});
-		button.append($('<i>').addClass('fa fa-list-ul'));
+		button.append($('<i>').addClass(""));
 		button.append(' ');
 		button.append($('<span>').addClass('d-none d-lg-inline').text('Format option'));
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] StringLiteral
public/src/client/composer-select-format.js:36:17
 			'aria-label': 'Format option',
 		});
 		button.append($('<i>').addClass('fa fa-list-ul'));
-		button.append(' ');
+		button.append("");
 		button.append($('<span>').addClass('d-none d-lg-inline').text('Format option'));
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:37:38
 		});
 		button.append($('<i>').addClass('fa fa-list-ul'));
 		button.append(' ');
-		button.append($('<span>').addClass('d-none d-lg-inline').text('Format option'));
+		button.append($('<span>').addClass("").text('Format option'));
 
 		const menu = $('<ul>').addClass('dropdown-menu dropdown-menu-end p-1').attr('role', 'menu');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:37:65
 		});
 		button.append($('<i>').addClass('fa fa-list-ul'));
 		button.append(' ');
-		button.append($('<span>').addClass('d-none d-lg-inline').text('Format option'));
+		button.append($('<span>').addClass('d-none d-lg-inline').text(""));
 
 		const menu = $('<ul>').addClass('dropdown-menu dropdown-menu-end p-1').attr('role', 'menu');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:39:35
 		button.append(' ');
 		button.append($('<span>').addClass('d-none d-lg-inline').text('Format option'));
 
-		const menu = $('<ul>').addClass('dropdown-menu dropdown-menu-end p-1').attr('role', 'menu');
+		const menu = $('<ul>').addClass("").attr('role', 'menu');
 
 		dropdown.append(button).append(menu);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:43:7
 
 		dropdown.append(button).append(menu);
 
-		if (!templates.length) {
+		if (false) {
 			menu.append(
 				$('<li>').addClass('px-3 py-2 text-muted small').text('No formats available yet')
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:43:26
 
 		dropdown.append(button).append(menu);
 
-		if (!templates.length) {
-			menu.append(
-				$('<li>').addClass('px-3 py-2 text-muted small').text('No formats available yet')
-			);
-		} else {
+		if (!templates.length) {} else {
 			templates.forEach((template) => {
 				const item = $('<li>');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:47:10
 			menu.append(
 				$('<li>').addClass('px-3 py-2 text-muted small').text('No formats available yet')
 			);
-		} else {
-			templates.forEach((template) => {
-				const item = $('<li>');
-				const link = $('<a>', {
-					href: '#',
-					role: 'menuitem',
-					class: 'dropdown-item rounded-1',
-					'data-template-id': template.id,
-				});
-
-				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
-				if (template.description) {
-					link.append($('<small>').addClass('text-muted d-block').text(template.description));
-				}
-
-				item.append(link);
-				menu.append(item);
-			});
-		}
+		} else {}
 
 		dropdown.on('click', '[data-template-id]', function (ev) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:48:36
 				$('<li>').addClass('px-3 py-2 text-muted small').text('No formats available yet')
 			);
 		} else {
-			templates.forEach((template) => {
-				const item = $('<li>');
-				const link = $('<a>', {
-					href: '#',
-					role: 'menuitem',
-					class: 'dropdown-item rounded-1',
-					'data-template-id': template.id,
-				});
-
-				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
-				if (template.description) {
-					link.append($('<small>').addClass('text-muted d-block').text(template.description));
-				}
-
-				item.append(link);
-				menu.append(item);
-			});
+			templates.forEach((template) => {});
 		}
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ObjectLiteral
public/src/client/composer-select-format.js:50:27
 		} else {
 			templates.forEach((template) => {
 				const item = $('<li>');
-				const link = $('<a>', {
-					href: '#',
-					role: 'menuitem',
-					class: 'dropdown-item rounded-1',
-					'data-template-id': template.id,
-				});
+				const link = $('<a>', {});
 
 				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:52:12
 				const item = $('<li>');
 				const link = $('<a>', {
 					href: '#',
-					role: 'menuitem',
+					role: "",
 					class: 'dropdown-item rounded-1',
 					'data-template-id': template.id,
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:58:9
 				});
 
 				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
-				if (template.description) {
+				if (false) {
 					link.append($('<small>').addClass('text-muted d-block').text(template.description));
 				}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:58:31
 				});
 
 				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
-				if (template.description) {
-					link.append($('<small>').addClass('text-muted d-block').text(template.description));
-				}
+				if (template.description) {}
 
 				item.append(link);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:59:20
 
 				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
 				if (template.description) {
-					link.append($('<small>').addClass('text-muted d-block').text(template.description));
+					link.append($("").addClass('text-muted d-block').text(template.description));
 				}
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:59:40
 
 				link.append($('<span>').addClass('template-label d-block fw-semibold').text(template.label));
 				if (template.description) {
-					link.append($('<small>').addClass('text-muted d-block').text(template.description));
+					link.append($('<small>').addClass("").text(template.description));
 				}
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:67:60
 			});
 		}
 
-		dropdown.on('click', '[data-template-id]', function (ev) {
-			ev.preventDefault();
-			const templateId = $(this).attr('data-template-id');
-			const template = templates.find(tpl => tpl.id === templateId);
-			if (!template) {
-				return;
-			}
-
-			dropdown.removeClass('show');
-			dropdown.find('.dropdown-menu').removeClass('show');
-			applyTemplate(postContainer, template);
-		});
+		dropdown.on('click', '[data-template-id]', function (ev) {});
 
 		return dropdown;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:69:36
 
 		dropdown.on('click', '[data-template-id]', function (ev) {
 			ev.preventDefault();
-			const templateId = $(this).attr('data-template-id');
+			const templateId = $(this).attr("");
 			const template = templates.find(tpl => tpl.id === templateId);
 			if (!template) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ArrowFunction
public/src/client/composer-select-format.js:70:36
 		dropdown.on('click', '[data-template-id]', function (ev) {
 			ev.preventDefault();
 			const templateId = $(this).attr('data-template-id');
-			const template = templates.find(tpl => tpl.id === templateId);
+			const template = templates.find(() => undefined);
 			if (!template) {
 				return;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:70:43
 		dropdown.on('click', '[data-template-id]', function (ev) {
 			ev.preventDefault();
 			const templateId = $(this).attr('data-template-id');
-			const template = templates.find(tpl => tpl.id === templateId);
+			const template = templates.find(tpl => true);
 			if (!template) {
 				return;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:71:19
 			ev.preventDefault();
 			const templateId = $(this).attr('data-template-id');
 			const template = templates.find(tpl => tpl.id === templateId);
-			if (!template) {
-				return;
-			}
+			if (!template) {}
 
 			dropdown.removeClass('show');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:71:8
 			ev.preventDefault();
 			const templateId = $(this).attr('data-template-id');
 			const template = templates.find(tpl => tpl.id === templateId);
-			if (!template) {
+			if (true) {
 				return;
 			}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:75:25
 				return;
 			}
 
-			dropdown.removeClass('show');
+			dropdown.removeClass("");
 			dropdown.find('.dropdown-menu').removeClass('show');
 			applyTemplate(postContainer, template);
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:76:48
 			}
 
 			dropdown.removeClass('show');
-			dropdown.find('.dropdown-menu').removeClass('show');
+			dropdown.find('.dropdown-menu').removeClass("");
 			applyTemplate(postContainer, template);
 		});
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:76:18
 			}
 
 			dropdown.removeClass('show');
-			dropdown.find('.dropdown-menu').removeClass('show');
+			dropdown.find("").removeClass('show');
 			applyTemplate(postContainer, template);
 		});
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:82:50
 
 		return dropdown;
 	}
-	function applyTemplate(postContainer, template) {
-		const textarea = postContainer.find('textarea');
-		if (!textarea.length) {
-			return;
-		}
-
-		const currentValue = textarea.val();
-		const trimmed = currentValue.replace(/\s+$/, '');
-		const separator = trimmed.length ? '\n\n' : '';
-		const newValue = trimmed + separator + template.body;
-
-		textarea.val(newValue).trigger('input').trigger('change');
-		textarea.focus();
-
-		const uuid = postContainer.attr('data-uuid');
-		if (uuid) {
-			require(['composer'], function (composer) {
-				if (composer.posts && composer.posts[uuid]) {
-					composer.posts[uuid].body = textarea.val();
-					composer.posts[uuid].modified = true;
-				}
-			});
-		}
-	}
+	function applyTemplate(postContainer, template) {}
 
 	function insertDropdown(postContainer) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:83:39
 		return dropdown;
 	}
 	function applyTemplate(postContainer, template) {
-		const textarea = postContainer.find('textarea');
+		const textarea = postContainer.find("");
 		if (!textarea.length) {
 			return;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:84:7
 	}
 	function applyTemplate(postContainer, template) {
 		const textarea = postContainer.find('textarea');
-		if (!textarea.length) {
+		if (true) {
 			return;
 		}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] BlockStatement
public/src/client/composer-select-format.js:84:25
 	}
 	function applyTemplate(postContainer, template) {
 		const textarea = postContainer.find('textarea');
-		if (!textarea.length) {
-			return;
-		}
+		if (!textarea.length) {}
 
 		const currentValue = textarea.val();
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:89:48
 		}
 
 		const currentValue = textarea.val();
-		const trimmed = currentValue.replace(/\s+$/, '');
+		const trimmed = currentValue.replace(/\s+$/, "Stryker was here!");
 		const separator = trimmed.length ? '\n\n' : '';
 		const newValue = trimmed + separator + template.body;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] Regex
public/src/client/composer-select-format.js:89:40
 		}
 
 		const currentValue = textarea.val();
-		const trimmed = currentValue.replace(/\s+$/, '');
+		const trimmed = currentValue.replace(/\s+/, '');
 		const separator = trimmed.length ? '\n\n' : '';
 		const newValue = trimmed + separator + template.body;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:90:47
 
 		const currentValue = textarea.val();
 		const trimmed = currentValue.replace(/\s+$/, '');
-		const separator = trimmed.length ? '\n\n' : '';
+		const separator = trimmed.length ? '\n\n' : "Stryker was here!";
 		const newValue = trimmed + separator + template.body;
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:90:38
 
 		const currentValue = textarea.val();
 		const trimmed = currentValue.replace(/\s+$/, '');
-		const separator = trimmed.length ? '\n\n' : '';
+		const separator = trimmed.length ? "" : '';
 		const newValue = trimmed + separator + template.body;
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://localhost:4567",
    "secret": "877373b1-6bd9-4f02-abd5-74038c7672aa",

[Killed] ArithmeticOperator
public/src/client/composer-select-format.js:91:20
 		const currentValue = textarea.val();
 		const trimmed = currentValue.replace(/\s+$/, '');
 		const separator = trimmed.length ? '\n\n' : '';
-		const newValue = trimmed + separator + template.body;
+		const newValue = trimmed + separator - template.body;
 
 		textarea.val(newValue).trigger('input').trigger('change');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ArithmeticOperator
public/src/client/composer-select-format.js:91:20
 		const currentValue = textarea.val();
 		const trimmed = currentValue.replace(/\s+$/, '');
 		const separator = trimmed.length ? '\n\n' : '';
-		const newValue = trimmed + separator + template.body;
+		const newValue = trimmed - separator + template.body;
 
 		textarea.val(newValue).trigger('input').trigger('change');
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:97:7
 		textarea.focus();
 
 		const uuid = postContainer.attr('data-uuid');
-		if (uuid) {
+		if (true) {
 			require(['composer'], function (composer) {
 				if (composer.posts && composer.posts[uuid]) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:97:7
 		textarea.focus();
 
 		const uuid = postContainer.attr('data-uuid');
-		if (uuid) {
+		if (false) {
 			require(['composer'], function (composer) {
 				if (composer.posts && composer.posts[uuid]) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:98:46
 
 		const uuid = postContainer.attr('data-uuid');
 		if (uuid) {
-			require(['composer'], function (composer) {
-				if (composer.posts && composer.posts[uuid]) {
-					composer.posts[uuid].body = textarea.val();
-					composer.posts[uuid].modified = true;
-				}
-			});
+			require(['composer'], function (composer) {});
 		}
 	}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:99:9
 		const uuid = postContainer.attr('data-uuid');
 		if (uuid) {
 			require(['composer'], function (composer) {
-				if (composer.posts && composer.posts[uuid]) {
+				if (false) {
 					composer.posts[uuid].body = textarea.val();
 					composer.posts[uuid].modified = true;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:99:9
 		const uuid = postContainer.attr('data-uuid');
 		if (uuid) {
 			require(['composer'], function (composer) {
-				if (composer.posts && composer.posts[uuid]) {
+				if (true) {
 					composer.posts[uuid].body = textarea.val();
 					composer.posts[uuid].modified = true;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
public/src/client/composer-select-format.js:101:38
 			require(['composer'], function (composer) {
 				if (composer.posts && composer.posts[uuid]) {
 					composer.posts[uuid].body = textarea.val();
-					composer.posts[uuid].modified = true;
+					composer.posts[uuid].modified = false;
 				}
 			});
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:107:41
 		}
 	}
 
-	function insertDropdown(postContainer) {
-		if (!postContainer || !postContainer.length) {
-			return;
-		}
-
-		const actionBar = postContainer.find('.action-bar').first();
-		if (!actionBar.length || actionBar.find('[component="composer/select-format"]').length) {
-			return;
-		}
-
-		const dropdown = buildDropdown(postContainer);
-		const discardButton = actionBar.find('.composer-discard').first();
-
-		if (discardButton.length) {
-			dropdown.insertAfter(discardButton);
-		} else {
-			actionBar.prepend(dropdown);
-		}
-	}
+	function insertDropdown(postContainer) {}
 
 	Dropdown.init = function () {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:108:48
 	}
 
 	function insertDropdown(postContainer) {
-		if (!postContainer || !postContainer.length) {
-			return;
-		}
+		if (!postContainer || !postContainer.length) {}
 
 		const actionBar = postContainer.find('.action-bar').first();
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
public/src/client/composer-select-format.js:108:7
 	}
 
 	function insertDropdown(postContainer) {
-		if (!postContainer || !postContainer.length) {
+		if (postContainer || !postContainer.length) {
 			return;
 		}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",
