[Killed] StringLiteral
public/src/client/composer-select-format.js:112:40
 			return;
 		}
 
-		const actionBar = postContainer.find('.action-bar').first();
+		const actionBar = postContainer.find("").first();
 		if (!actionBar.length || actionBar.find('[component="composer/select-format"]').length) {
 			return;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
public/src/client/composer-select-format.js:113:7
 		}
 
 		const actionBar = postContainer.find('.action-bar').first();
-		if (!actionBar.length || actionBar.find('[component="composer/select-format"]').length) {
+		if (actionBar.length || actionBar.find('[component="composer/select-format"]').length) {
 			return;
 		}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] LogicalOperator
public/src/client/composer-select-format.js:113:7
 		}
 
 		const actionBar = postContainer.find('.action-bar').first();
-		if (!actionBar.length || actionBar.find('[component="composer/select-format"]').length) {
+		if (!actionBar.length && actionBar.find('[component="composer/select-format"]').length) {
 			return;
 		}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:120:7
 		const dropdown = buildDropdown(postContainer);
 		const discardButton = actionBar.find('.composer-discard').first();
 
-		if (discardButton.length) {
+		if (false) {
 			dropdown.insertAfter(discardButton);
 		} else {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:120:7
 		const dropdown = buildDropdown(postContainer);
 		const discardButton = actionBar.find('.composer-discard').first();
 
-		if (discardButton.length) {
+		if (true) {
 			dropdown.insertAfter(discardButton);
 		} else {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:122:10
 
 		if (discardButton.length) {
 			dropdown.insertAfter(discardButton);
-		} else {
-			actionBar.prepend(dropdown);
-		}
+		} else {}
 	}
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:127:30
 		}
 	}
 
-	Dropdown.init = function () {
-		if (Dropdown.initialised) {
-			return;
-		}
-		Dropdown.initialised = true;
-
-		hooks.on('action:composer.enhanced', function (data) {
-			insertDropdown(data && data.postContainer);
-		});
-
-		hooks.on('action:composer.loadDraft', function (data) {
-			insertDropdown(data && data.postContainer);
-		});
-
-		$('[component="composer"]').each(function () {
-			insertDropdown($(this));
-		});
-	};
+	Dropdown.init = function () {};
 
 	return Dropdown;
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:128:7
 	}
 
 	Dropdown.init = function () {
-		if (Dropdown.initialised) {
+		if (true) {
 			return;
 		}
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:128:29
 	}
 
 	Dropdown.init = function () {
-		if (Dropdown.initialised) {
-			return;
-		}
+		if (Dropdown.initialised) {}
 		Dropdown.initialised = true;
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BooleanLiteral
public/src/client/composer-select-format.js:131:26
 		if (Dropdown.initialised) {
 			return;
 		}
-		Dropdown.initialised = true;
+		Dropdown.initialised = false;
 
 		hooks.on('action:composer.enhanced', function (data) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:133:56
 		}
 		Dropdown.initialised = true;
 
-		hooks.on('action:composer.enhanced', function (data) {
-			insertDropdown(data && data.postContainer);
-		});
+		hooks.on('action:composer.enhanced', function (data) {});
 
 		hooks.on('action:composer.loadDraft', function (data) {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:133:12
 		}
 		Dropdown.initialised = true;
 
-		hooks.on('action:composer.enhanced', function (data) {
+		hooks.on("", function (data) {
 			insertDropdown(data && data.postContainer);
 		});
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:134:19
 		Dropdown.initialised = true;
 
 		hooks.on('action:composer.enhanced', function (data) {
-			insertDropdown(data && data.postContainer);
+			insertDropdown(false);
 		});
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:134:19
 		Dropdown.initialised = true;
 
 		hooks.on('action:composer.enhanced', function (data) {
-			insertDropdown(data && data.postContainer);
+			insertDropdown(true);
 		});
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:137:57
 			insertDropdown(data && data.postContainer);
 		});
 
-		hooks.on('action:composer.loadDraft', function (data) {
-			insertDropdown(data && data.postContainer);
-		});
+		hooks.on('action:composer.loadDraft', function (data) {});
 
 		$('[component="composer"]').each(function () {
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:138:19
 		});
 
 		hooks.on('action:composer.loadDraft', function (data) {
-			insertDropdown(data && data.postContainer);
+			insertDropdown(false);
 		});
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] ConditionalExpression
public/src/client/composer-select-format.js:138:19
 		});
 
 		hooks.on('action:composer.loadDraft', function (data) {
-			insertDropdown(data && data.postContainer);
+			insertDropdown(true);
 		});
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] BlockStatement
public/src/client/composer-select-format.js:141:48
 			insertDropdown(data && data.postContainer);
 		});
 
-		$('[component="composer"]').each(function () {
-			insertDropdown($(this));
-		});
+		$('[component="composer"]').each(function () {});
 	};
 
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",

[Killed] StringLiteral
public/src/client/composer-select-format.js:141:5
 			insertDropdown(data && data.postContainer);
 		});
 
-		$('[component="composer"]').each(function () {
+		$("").each(function () {
 			insertDropdown($(this));
 		});
killedBy: All tests
statusReason: > nodebb@4.4.6 test
> nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://localhost:4567",
